In [1]:
import pandas as pd

In [2]:
df= pd.read_csv('election_data.csv')
df.head()

   Voter ID County Candidate
0  12864552  Marsh      Khan
1  17444633  Marsh    Correy
2  19330107  Marsh      Khan
3  19865775  Queen      Khan
4  11927875  Marsh      Khan

In [3]:
Total_vote=len(df.index)
Total_vote

3521001

In [4]:
ab=df.groupby(['Candidate'])

In [5]:
ab.count()

           Voter ID   County
Candidate
Correy       704200   704200
Khan        2218231  2218231
Li           492940   492940
O'Tooley     105630   105630

In [6]:
df1=ab.count().rename(columns={'Voter ID':'cast_vote'})
df1.head()

           cast_vote   County
Candidate
Correy        704200   704200
Khan         2218231  2218231
Li            492940   492940
O'Tooley      105630   105630

In [7]:
df2=df1.drop(columns='County')
df2.head()

           cast_vote
Candidate
Correy        704200
Khan         2218231
Li            492940
O'Tooley      105630

In [21]:
df2['Percentage']=round(df2['cast_vote']/Total_vote*100, 2)
df2

           cast_vote  Percentage
Candidate
Correy        704200        20.0
Khan         2218231        63.0
Li            492940        14.0
O'Tooley      105630         3.0

In [23]:
df2.idxmax()

cast_vote     Khan
Percentage    Khan
dtype: object